/*----------------------------------------------------------------------------------------------------
 #
 #	Copyright (c) 2022 Yuankang Liang(XerolySkinner)
 #
 #	本软件按原样提供,无任何明示或暗示
 #	在任何情况下,作者都不承担任何损害赔偿责任
 #
 #	使用的许可声明:
 #	1.	不得歪曲本软件的来源,你不能声称你编写了原始软件.
 #	2.	免费授予以任何目的,前提是版权声明出现在所有副本中.
 #		并且版权声明和许可声明同时出现.
 #	3.	你有使用,复制,修改,分发,和销售本软件的许可.
 #	4.	如果你在产品中使用,产品文档中的声明是赞赏的但不是必须的.
 #	5.	本通知不得从任何来源删除或更改.
 #
 #	Yuankang Liang(XerolySkinner)
 #		E-mail:zabbcccbbaz@163.com
 #		QQ:2715099320
 #		Mobile Phone:13005636215
 #
 #	All rights reserved.
 */

/**
 * @file		vartable.cpp
 * @brief		全局向量在此生成
 * @mainpage	主要信息
 * @author		Yuankang Liang(XerolySkinner)
 * @email		zabbcccbbaz@163.com
 * @version		V1.0.0
 * @date		2022-11-07 18:50
 */


//////////////////////////////////////////////////////////////////////////////////////////////////////
//----------------------------------------------------------------------------------------------------
//	头文件
#include "vartable.h"
//////////////////////////////////////////////////////////////////////////////////////////////////////
//----------------------------------------------------------------------------------------------------
//	程序
//	
void reboot(void){
	__set_FAULTMASK(1);
	HAL_NVIC_SystemReset();}
MSH_CMD_EXPORT(reboot,reboot system);
//----------------------------------------------------------------------------------------------------
uint16_t u16Endian(uint16_t dat){uint16_t temp;
	((char*)(&temp))[0]=((char*)(&dat))[1];
	((char*)(&temp))[1]=((char*)(&dat))[0];
	return temp;}
uint32_t u32Endian(uint32_t dat){uint32_t temp;
	((uint16_t*)(&temp))[1]=u16Endian(((uint16_t*)(&dat))[1]);
	((uint16_t*)(&temp))[0]=u16Endian(((uint16_t*)(&dat))[0]);
	return temp;}
//////////////////////////////////////////////////////////////////////////////////////////////////////

